yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l051f3.h
#define MASK_FLASH_CR2_PRG       0x01
#define MASK_FLASH_CR2_FPRG      0x10
#define MASK_FLASH_CR2_ERASE     0x20
#define MASK_FLASH_CR2_WPRG      0x40
#define MASK_FLASH_CR2_OPT       0x80

#define MASK_FLASH_IAPSR_WR_PG_DIS 0x01
#define MASK_FLASH_IAPSR_PUL     0x02
#define MASK_FLASH_IAPSR_EOP     0x04
#define MASK_FLASH_IAPSR_DUL     0x08
#define MASK_FLASH_IAPSR_HVOFF   0x40


/*-------------------------------------------------------------------------
 *      DMA1 register definitions
 *-----------------------------------------------------------------------*/
/* DMA1 global configuration & status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char GEN         : 1;
  unsigned char GB          : 1;
  unsigned char TO          : 6;
} __BITS_DMA1_GCSR;
#endif
__IO_REG8_BIT(DMA1_GCSR,   0x5070, __READ_WRITE, __BITS_DMA1_GCSR);

/* DMA1 global interrupt register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IFC0        : 1;
  unsigned char IFC1        : 1;
  unsigned char IFC2        : 1;
  unsigned char IFC3        : 1;
} __BITS_DMA1_GIR1;
#endif
__IO_REG8_BIT(DMA1_GIR1,   0x5071, __READ, __BITS_DMA1_GIR1);

/* DMA1 channel 0 configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN          : 1;
  unsigned char TCIE        : 1;
  unsigned char HTIE        : 1;
  unsigned char DIR         : 1;
  unsigned char CIRC        : 1;
  unsigned char MINCDEC     : 1;
} __BITS_DMA1_C0CR;
#endif
__IO_REG8_BIT(DMA1_C0CR,   0x5075, __READ_WRITE, __BITS_DMA1_C0CR);

/* DMA1 channel 0 status */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char TCIF        : 1;
  unsigned char HTIF        : 1;
  unsigned char TSIZE       : 1;
  unsigned char PL0         : 1;
  unsigned char PL1         : 1;
  unsigned char PEND        : 1;
  unsigned char BUSY        : 1;
} __BITS_DMA1_C0SPR;
#endif
__IO_REG8_BIT(DMA1_C0SPR,  0x5076, __READ_WRITE, __BITS_DMA1_C0SPR);

/* DMA1 number of data to transfer register (channel 0) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NDT0        : 1;
  unsigned char NDT1        : 1;
  unsigned char NDT2        : 1;
  unsigned char NDT3        : 1;
  unsigned char NDT4        : 1;
  unsigned char NDT5        : 1;
  unsigned char NDT6        : 1;
  unsigned char NDT7        : 1;
} __BITS_DMA1_C0NDTR;
#endif
__IO_REG8_BIT(DMA1_C0NDTR, 0x5077, __READ_WRITE, __BITS_DMA1_C0NDTR);

/* DMA1 peripheral address high register (channel 0) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PA8         : 1;
  unsigned char PA9         : 1;
  unsigned char PA10        : 1;
  unsigned char PA11        : 1;
  unsigned char PA12        : 1;
  unsigned char PA13        : 1;
  unsigned char PA14        : 1;
  unsigned char PA15        : 1;
} __BITS_DMA1_C0PARH;
#endif
__IO_REG8_BIT(DMA1_C0PARH, 0x5078, __READ_WRITE, __BITS_DMA1_C0PARH);

/* DMA1 peripheral address low register (channel 0) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PA0         : 1;
  unsigned char PA1         : 1;
  unsigned char PA2         : 1;
  unsigned char PA3         : 1;
  unsigned char PA4         : 1;
  unsigned char PA5         : 1;
  unsigned char PA6         : 1;
  unsigned char PA7         : 1;
} __BITS_DMA1_C0PARL;
#endif
__IO_REG8_BIT(DMA1_C0PARL, 0x5079, __READ_WRITE, __BITS_DMA1_C0PARL);

/* DMA1 memory 0 address high register (channel 0) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A8        : 1;
  unsigned char M0A9        : 1;
  unsigned char M0A10       : 1;
  unsigned char M0A11       : 1;
  unsigned char M0A12       : 1;
  unsigned char M0A13       : 1;
  unsigned char M0A14       : 1;
  unsigned char M0A15       : 1;
} __BITS_DMA1_C0M0ARH;
#endif
__IO_REG8_BIT(DMA1_C0M0ARH, 0x507B, __READ_WRITE, __BITS_DMA1_C0M0ARH);

/* DMA1 memory 0 address low register (channel 0) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A0        : 1;
  unsigned char M0A1        : 1;
  unsigned char M0A2        : 1;
  unsigned char M0A3        : 1;
  unsigned char M0A4        : 1;
  unsigned char M0A5        : 1;
  unsigned char M0A6        : 1;
  unsigned char M0A7        : 1;
} __BITS_DMA1_C0M0ARL;
#endif
__IO_REG8_BIT(DMA1_C0M0ARL, 0x507C, __READ_WRITE, __BITS_DMA1_C0M0ARL);

/* DMA1 channel 1 configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN          : 1;
  unsigned char TCIE        : 1;
  unsigned char HTIE        : 1;
  unsigned char DIR         : 1;
  unsigned char CIRC        : 1;
  unsigned char MINCDEC     : 1;
} __BITS_DMA1_C1CR;
#endif
__IO_REG8_BIT(DMA1_C1CR,   0x507F, __READ_WRITE, __BITS_DMA1_C1CR);

/* DMA1 channel 1 status */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char TCIF        : 1;
  unsigned char HTIF        : 1;
  unsigned char TSIZE       : 1;
  unsigned char PL0         : 1;
  unsigned char PL1         : 1;
  unsigned char PEND        : 1;
  unsigned char BUSY        : 1;
} __BITS_DMA1_C1SPR;
#endif
__IO_REG8_BIT(DMA1_C1SPR,  0x5080, __READ_WRITE, __BITS_DMA1_C1SPR);

/* DMA1 number of data to transfer register (channel 1) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NDT0        : 1;
  unsigned char NDT1        : 1;
  unsigned char NDT2        : 1;
  unsigned char NDT3        : 1;
  unsigned char NDT4        : 1;
  unsigned char NDT5        : 1;
  unsigned char NDT6        : 1;
  unsigned char NDT7        : 1;
} __BITS_DMA1_C1NDTR;
#endif
__IO_REG8_BIT(DMA1_C1NDTR, 0x5081, __READ_WRITE, __BITS_DMA1_C1NDTR);

/* DMA1 peripheral address high register (channel 1) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PA8         : 1;
  unsigned char PA9         : 1;
  unsigned char PA10        : 1;
  unsigned char PA11        : 1;
  unsigned char PA12        : 1;
  unsigned char PA13        : 1;
  unsigned char PA14        : 1;
  unsigned char PA15        : 1;
} __BITS_DMA1_C1PARH;
#endif
__IO_REG8_BIT(DMA1_C1PARH, 0x5082, __READ_WRITE, __BITS_DMA1_C1PARH);

/* DMA1 peripheral address low register (channel 1) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PA0         : 1;
  unsigned char PA1         : 1;
  unsigned char PA2         : 1;
  unsigned char PA3         : 1;
  unsigned char PA4         : 1;
  unsigned char PA5         : 1;
  unsigned char PA6         : 1;
  unsigned char PA7         : 1;
} __BITS_DMA1_C1PARL;
#endif
__IO_REG8_BIT(DMA1_C1PARL, 0x5083, __READ_WRITE, __BITS_DMA1_C1PARL);

/* DMA1 memory 0 address high register (channel 1) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A8        : 1;
  unsigned char M0A9        : 1;
  unsigned char M0A10       : 1;
  unsigned char M0A11       : 1;
  unsigned char M0A12       : 1;
  unsigned char M0A13       : 1;
  unsigned char M0A14       : 1;
  unsigned char M0A15       : 1;
} __BITS_DMA1_C1M0ARH;
#endif
__IO_REG8_BIT(DMA1_C1M0ARH, 0x5085, __READ_WRITE, __BITS_DMA1_C1M0ARH);

