yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l051f3.h
/* DMA1 memory 0 address low register (channel 1) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A0        : 1;
  unsigned char M0A1        : 1;
  unsigned char M0A2        : 1;
  unsigned char M0A3        : 1;
  unsigned char M0A4        : 1;
  unsigned char M0A5        : 1;
  unsigned char M0A6        : 1;
  unsigned char M0A7        : 1;
} __BITS_DMA1_C1M0ARL;
#endif
__IO_REG8_BIT(DMA1_C1M0ARL, 0x5086, __READ_WRITE, __BITS_DMA1_C1M0ARL);

/* DMA1 channel 2 configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN          : 1;
  unsigned char TCIE        : 1;
  unsigned char HTIE        : 1;
  unsigned char DIR         : 1;
  unsigned char CIRC        : 1;
  unsigned char MINCDEC     : 1;
} __BITS_DMA1_C2CR;
#endif
__IO_REG8_BIT(DMA1_C2CR,   0x5089, __READ_WRITE, __BITS_DMA1_C2CR);

/* DMA1 channel 2 status */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char TCIF        : 1;
  unsigned char HTIF        : 1;
  unsigned char TSIZE       : 1;
  unsigned char PL0         : 1;
  unsigned char PL1         : 1;
  unsigned char PEND        : 1;
  unsigned char BUSY        : 1;
} __BITS_DMA1_C2SPR;
#endif
__IO_REG8_BIT(DMA1_C2SPR,  0x508A, __READ_WRITE, __BITS_DMA1_C2SPR);

/* DMA1 number of data to transfer register (channel 2) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NDT0        : 1;
  unsigned char NDT1        : 1;
  unsigned char NDT2        : 1;
  unsigned char NDT3        : 1;
  unsigned char NDT4        : 1;
  unsigned char NDT5        : 1;
  unsigned char NDT6        : 1;
  unsigned char NDT7        : 1;
} __BITS_DMA1_C2NDTR;
#endif
__IO_REG8_BIT(DMA1_C2NDTR, 0x508B, __READ_WRITE, __BITS_DMA1_C2NDTR);

/* DMA1 peripheral address high register (channel 2) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PA8         : 1;
  unsigned char PA9         : 1;
  unsigned char PA10        : 1;
  unsigned char PA11        : 1;
  unsigned char PA12        : 1;
  unsigned char PA13        : 1;
  unsigned char PA14        : 1;
  unsigned char PA15        : 1;
} __BITS_DMA1_C2PARH;
#endif
__IO_REG8_BIT(DMA1_C2PARH, 0x508C, __READ_WRITE, __BITS_DMA1_C2PARH);

/* DMA1 peripheral address low register (channel 2) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PA0         : 1;
  unsigned char PA1         : 1;
  unsigned char PA2         : 1;
  unsigned char PA3         : 1;
  unsigned char PA4         : 1;
  unsigned char PA5         : 1;
  unsigned char PA6         : 1;
  unsigned char PA7         : 1;
} __BITS_DMA1_C2PARL;
#endif
__IO_REG8_BIT(DMA1_C2PARL, 0x508D, __READ_WRITE, __BITS_DMA1_C2PARL);

/* DMA1 memory 0 address high register (channel 2) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A8        : 1;
  unsigned char M0A9        : 1;
  unsigned char M0A10       : 1;
  unsigned char M0A11       : 1;
  unsigned char M0A12       : 1;
  unsigned char M0A13       : 1;
  unsigned char M0A14       : 1;
  unsigned char M0A15       : 1;
} __BITS_DMA1_C2M0ARH;
#endif
__IO_REG8_BIT(DMA1_C2M0ARH, 0x508F, __READ_WRITE, __BITS_DMA1_C2M0ARH);

/* DMA1 memory 0 address low register (channel 2) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A0        : 1;
  unsigned char M0A1        : 1;
  unsigned char M0A2        : 1;
  unsigned char M0A3        : 1;
  unsigned char M0A4        : 1;
  unsigned char M0A5        : 1;
  unsigned char M0A6        : 1;
  unsigned char M0A7        : 1;
} __BITS_DMA1_C2M0ARL;
#endif
__IO_REG8_BIT(DMA1_C2M0ARL, 0x5090, __READ_WRITE, __BITS_DMA1_C2M0ARL);

/* DMA1 channel 3 configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN          : 1;
  unsigned char TCIE        : 1;
  unsigned char HTIE        : 1;
  unsigned char DIR         : 1;
  unsigned char CIRC        : 1;
  unsigned char MINCDEC     : 1;
  unsigned char MEM         : 1;
} __BITS_DMA1_C3CR;
#endif
__IO_REG8_BIT(DMA1_C3CR,   0x5093, __READ_WRITE, __BITS_DMA1_C3CR);

/* DMA1 channel 3 status */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char TCIF        : 1;
  unsigned char HTIF        : 1;
  unsigned char TSIZE       : 1;
  unsigned char PL0         : 1;
  unsigned char PL1         : 1;
  unsigned char PEND        : 1;
  unsigned char BUSY        : 1;
} __BITS_DMA1_C3SPR;
#endif
__IO_REG8_BIT(DMA1_C3SPR,  0x5094, __READ_WRITE, __BITS_DMA1_C3SPR);

/* DMA1 number of data to transfer register (channel 3) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NDT0        : 1;
  unsigned char NDT1        : 1;
  unsigned char NDT2        : 1;
  unsigned char NDT3        : 1;
  unsigned char NDT4        : 1;
  unsigned char NDT5        : 1;
  unsigned char NDT6        : 1;
  unsigned char NDT7        : 1;
} __BITS_DMA1_C3NDTR;
#endif
__IO_REG8_BIT(DMA1_C3NDTR, 0x5095, __READ_WRITE, __BITS_DMA1_C3NDTR);

/* DMA1 peripheral address high register (channel 3) */
#ifdef __IAR_SYSTEMS_ICC__
typedef union
{
  struct
  {
    unsigned char PA8         : 1;
    unsigned char PA9         : 1;
    unsigned char PA10        : 1;
    unsigned char PA11        : 1;
    unsigned char PA12        : 1;
    unsigned char PA13        : 1;
    unsigned char PA14        : 1;
    unsigned char PA15        : 1;
  } mem_clr;
  struct
  {
    unsigned char M1A8        : 1;
    unsigned char M1A9        : 1;
    unsigned char M1A10       : 1;
    unsigned char M1A11       : 1;
    unsigned char M1A12       : 1;
    unsigned char M1A13       : 1;
    unsigned char M1A14       : 1;
    unsigned char M1A15       : 1;
  } mem_set;
} __BITS_DMA1_C3PARH_C3M1ARH;
#endif
__IO_REG8_BIT(DMA1_C3PARH_C3M1ARH, 0x5096, __READ_WRITE, __BITS_DMA1_C3PARH_C3M1ARH);

/* Register aliases for DMA1_C3PARH_C3M1ARH */
#define DMA1_C3PARH      DMA1_C3PARH_C3M1ARH
#define DMA1_C3PARH_bit  DMA1_C3PARH_C3M1ARH_bit.mem_clr

#define DMA1_C3M1ARH     DMA1_C3PARH_C3M1ARH
#define DMA1_C3M1ARH_bit DMA1_C3PARH_C3M1ARH_bit.mem_set


/* DMA1 peripheral address low register (channel 3) */
#ifdef __IAR_SYSTEMS_ICC__
typedef union
{
  struct
  {
    unsigned char PA0         : 1;
    unsigned char PA1         : 1;
    unsigned char PA2         : 1;
    unsigned char PA3         : 1;
    unsigned char PA4         : 1;
    unsigned char PA5         : 1;
    unsigned char PA6         : 1;
    unsigned char PA7         : 1;
  } mem_clr;
  struct
  {
    unsigned char M1A0        : 1;
    unsigned char M1A1        : 1;
    unsigned char M1A2        : 1;
    unsigned char M1A3        : 1;
    unsigned char M1A4        : 1;
    unsigned char M1A5        : 1;
    unsigned char M1A6        : 1;
    unsigned char M1A7        : 1;
  } mem_set;
} __BITS_DMA1_C3PARL_C3M1ARL;
#endif
__IO_REG8_BIT(DMA1_C3PARL_C3M1ARL, 0x5097, __READ_WRITE, __BITS_DMA1_C3PARL_C3M1ARL);

/* Register aliases for DMA1_C3PARL_C3M1ARL */
#define DMA1_C3PARL      DMA1_C3PARL_C3M1ARL
#define DMA1_C3PARL_bit  DMA1_C3PARL_C3M1ARL_bit.mem_clr

#define DMA1_C3M1ARL     DMA1_C3PARL_C3M1ARL
#define DMA1_C3M1ARL_bit DMA1_C3PARL_C3M1ARL_bit.mem_set


/* DMA1 memory 0 address high register (channel 3) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A8        : 1;
  unsigned char M0A9        : 1;
  unsigned char M0A10       : 1;
  unsigned char M0A11       : 1;
  unsigned char M0A12       : 1;
  unsigned char M0A13       : 1;
  unsigned char M0A14       : 1;
  unsigned char M0A15       : 1;
} __BITS_DMA1_C3M0ARH;
#endif
__IO_REG8_BIT(DMA1_C3M0ARH, 0x5099, __READ_WRITE, __BITS_DMA1_C3M0ARH);

