yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l051f3.h
/* DMA1 memory 0 address low register (channel 3) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A0        : 1;
  unsigned char M0A1        : 1;
  unsigned char M0A2        : 1;
  unsigned char M0A3        : 1;
  unsigned char M0A4        : 1;
  unsigned char M0A5        : 1;
  unsigned char M0A6        : 1;
  unsigned char M0A7        : 1;
} __BITS_DMA1_C3M0ARL;
#endif
__IO_REG8_BIT(DMA1_C3M0ARL, 0x509A, __READ_WRITE, __BITS_DMA1_C3M0ARL);


/*-------------------------------------------------------------------------
 *      DMA1 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define DMA1_GCSR_GEN            DMA1_GCSR_bit.GEN
#define DMA1_GCSR_GB             DMA1_GCSR_bit.GB
#define DMA1_GCSR_TO             DMA1_GCSR_bit.TO

#define DMA1_GIR1_IFC0           DMA1_GIR1_bit.IFC0
#define DMA1_GIR1_IFC1           DMA1_GIR1_bit.IFC1
#define DMA1_GIR1_IFC2           DMA1_GIR1_bit.IFC2
#define DMA1_GIR1_IFC3           DMA1_GIR1_bit.IFC3

#define DMA1_C0CR_EN             DMA1_C0CR_bit.EN
#define DMA1_C0CR_TCIE           DMA1_C0CR_bit.TCIE
#define DMA1_C0CR_HTIE           DMA1_C0CR_bit.HTIE
#define DMA1_C0CR_DIR            DMA1_C0CR_bit.DIR
#define DMA1_C0CR_CIRC           DMA1_C0CR_bit.CIRC
#define DMA1_C0CR_MINCDEC        DMA1_C0CR_bit.MINCDEC

#define DMA1_C0SPR_TCIF          DMA1_C0SPR_bit.TCIF
#define DMA1_C0SPR_HTIF          DMA1_C0SPR_bit.HTIF
#define DMA1_C0SPR_TSIZE         DMA1_C0SPR_bit.TSIZE
#define DMA1_C0SPR_PL0           DMA1_C0SPR_bit.PL0
#define DMA1_C0SPR_PL1           DMA1_C0SPR_bit.PL1
#define DMA1_C0SPR_PEND          DMA1_C0SPR_bit.PEND
#define DMA1_C0SPR_BUSY          DMA1_C0SPR_bit.BUSY

#define DMA1_C0NDTR_NDT0         DMA1_C0NDTR_bit.NDT0
#define DMA1_C0NDTR_NDT1         DMA1_C0NDTR_bit.NDT1
#define DMA1_C0NDTR_NDT2         DMA1_C0NDTR_bit.NDT2
#define DMA1_C0NDTR_NDT3         DMA1_C0NDTR_bit.NDT3
#define DMA1_C0NDTR_NDT4         DMA1_C0NDTR_bit.NDT4
#define DMA1_C0NDTR_NDT5         DMA1_C0NDTR_bit.NDT5
#define DMA1_C0NDTR_NDT6         DMA1_C0NDTR_bit.NDT6
#define DMA1_C0NDTR_NDT7         DMA1_C0NDTR_bit.NDT7

#define DMA1_C0PARH_PA8          DMA1_C0PARH_bit.PA8
#define DMA1_C0PARH_PA9          DMA1_C0PARH_bit.PA9
#define DMA1_C0PARH_PA10         DMA1_C0PARH_bit.PA10
#define DMA1_C0PARH_PA11         DMA1_C0PARH_bit.PA11
#define DMA1_C0PARH_PA12         DMA1_C0PARH_bit.PA12
#define DMA1_C0PARH_PA13         DMA1_C0PARH_bit.PA13
#define DMA1_C0PARH_PA14         DMA1_C0PARH_bit.PA14
#define DMA1_C0PARH_PA15         DMA1_C0PARH_bit.PA15

#define DMA1_C0PARL_PA0          DMA1_C0PARL_bit.PA0
#define DMA1_C0PARL_PA1          DMA1_C0PARL_bit.PA1
#define DMA1_C0PARL_PA2          DMA1_C0PARL_bit.PA2
#define DMA1_C0PARL_PA3          DMA1_C0PARL_bit.PA3
#define DMA1_C0PARL_PA4          DMA1_C0PARL_bit.PA4
#define DMA1_C0PARL_PA5          DMA1_C0PARL_bit.PA5
#define DMA1_C0PARL_PA6          DMA1_C0PARL_bit.PA6
#define DMA1_C0PARL_PA7          DMA1_C0PARL_bit.PA7

#define DMA1_C0M0ARH_M0A8        DMA1_C0M0ARH_bit.M0A8
#define DMA1_C0M0ARH_M0A9        DMA1_C0M0ARH_bit.M0A9
#define DMA1_C0M0ARH_M0A10       DMA1_C0M0ARH_bit.M0A10
#define DMA1_C0M0ARH_M0A11       DMA1_C0M0ARH_bit.M0A11
#define DMA1_C0M0ARH_M0A12       DMA1_C0M0ARH_bit.M0A12
#define DMA1_C0M0ARH_M0A13       DMA1_C0M0ARH_bit.M0A13
#define DMA1_C0M0ARH_M0A14       DMA1_C0M0ARH_bit.M0A14
#define DMA1_C0M0ARH_M0A15       DMA1_C0M0ARH_bit.M0A15

#define DMA1_C0M0ARL_M0A0        DMA1_C0M0ARL_bit.M0A0
#define DMA1_C0M0ARL_M0A1        DMA1_C0M0ARL_bit.M0A1
#define DMA1_C0M0ARL_M0A2        DMA1_C0M0ARL_bit.M0A2
#define DMA1_C0M0ARL_M0A3        DMA1_C0M0ARL_bit.M0A3
#define DMA1_C0M0ARL_M0A4        DMA1_C0M0ARL_bit.M0A4
#define DMA1_C0M0ARL_M0A5        DMA1_C0M0ARL_bit.M0A5
#define DMA1_C0M0ARL_M0A6        DMA1_C0M0ARL_bit.M0A6
#define DMA1_C0M0ARL_M0A7        DMA1_C0M0ARL_bit.M0A7

#define DMA1_C1CR_EN             DMA1_C1CR_bit.EN
#define DMA1_C1CR_TCIE           DMA1_C1CR_bit.TCIE
#define DMA1_C1CR_HTIE           DMA1_C1CR_bit.HTIE
#define DMA1_C1CR_DIR            DMA1_C1CR_bit.DIR
#define DMA1_C1CR_CIRC           DMA1_C1CR_bit.CIRC
#define DMA1_C1CR_MINCDEC        DMA1_C1CR_bit.MINCDEC

#define DMA1_C1SPR_TCIF          DMA1_C1SPR_bit.TCIF
#define DMA1_C1SPR_HTIF          DMA1_C1SPR_bit.HTIF
#define DMA1_C1SPR_TSIZE         DMA1_C1SPR_bit.TSIZE
#define DMA1_C1SPR_PL0           DMA1_C1SPR_bit.PL0
#define DMA1_C1SPR_PL1           DMA1_C1SPR_bit.PL1
#define DMA1_C1SPR_PEND          DMA1_C1SPR_bit.PEND
#define DMA1_C1SPR_BUSY          DMA1_C1SPR_bit.BUSY

#define DMA1_C1NDTR_NDT0         DMA1_C1NDTR_bit.NDT0
#define DMA1_C1NDTR_NDT1         DMA1_C1NDTR_bit.NDT1
#define DMA1_C1NDTR_NDT2         DMA1_C1NDTR_bit.NDT2
#define DMA1_C1NDTR_NDT3         DMA1_C1NDTR_bit.NDT3
#define DMA1_C1NDTR_NDT4         DMA1_C1NDTR_bit.NDT4
#define DMA1_C1NDTR_NDT5         DMA1_C1NDTR_bit.NDT5
#define DMA1_C1NDTR_NDT6         DMA1_C1NDTR_bit.NDT6
#define DMA1_C1NDTR_NDT7         DMA1_C1NDTR_bit.NDT7

#define DMA1_C1PARH_PA8          DMA1_C1PARH_bit.PA8
#define DMA1_C1PARH_PA9          DMA1_C1PARH_bit.PA9
#define DMA1_C1PARH_PA10         DMA1_C1PARH_bit.PA10
#define DMA1_C1PARH_PA11         DMA1_C1PARH_bit.PA11
#define DMA1_C1PARH_PA12         DMA1_C1PARH_bit.PA12
#define DMA1_C1PARH_PA13         DMA1_C1PARH_bit.PA13
#define DMA1_C1PARH_PA14         DMA1_C1PARH_bit.PA14
#define DMA1_C1PARH_PA15         DMA1_C1PARH_bit.PA15

#define DMA1_C1PARL_PA0          DMA1_C1PARL_bit.PA0
#define DMA1_C1PARL_PA1          DMA1_C1PARL_bit.PA1
#define DMA1_C1PARL_PA2          DMA1_C1PARL_bit.PA2
#define DMA1_C1PARL_PA3          DMA1_C1PARL_bit.PA3
#define DMA1_C1PARL_PA4          DMA1_C1PARL_bit.PA4
#define DMA1_C1PARL_PA5          DMA1_C1PARL_bit.PA5
#define DMA1_C1PARL_PA6          DMA1_C1PARL_bit.PA6
#define DMA1_C1PARL_PA7          DMA1_C1PARL_bit.PA7

#define DMA1_C1M0ARH_M0A8        DMA1_C1M0ARH_bit.M0A8
#define DMA1_C1M0ARH_M0A9        DMA1_C1M0ARH_bit.M0A9
#define DMA1_C1M0ARH_M0A10       DMA1_C1M0ARH_bit.M0A10
#define DMA1_C1M0ARH_M0A11       DMA1_C1M0ARH_bit.M0A11
#define DMA1_C1M0ARH_M0A12       DMA1_C1M0ARH_bit.M0A12
#define DMA1_C1M0ARH_M0A13       DMA1_C1M0ARH_bit.M0A13
#define DMA1_C1M0ARH_M0A14       DMA1_C1M0ARH_bit.M0A14
#define DMA1_C1M0ARH_M0A15       DMA1_C1M0ARH_bit.M0A15

#define DMA1_C1M0ARL_M0A0        DMA1_C1M0ARL_bit.M0A0
#define DMA1_C1M0ARL_M0A1        DMA1_C1M0ARL_bit.M0A1
#define DMA1_C1M0ARL_M0A2        DMA1_C1M0ARL_bit.M0A2
#define DMA1_C1M0ARL_M0A3        DMA1_C1M0ARL_bit.M0A3
#define DMA1_C1M0ARL_M0A4        DMA1_C1M0ARL_bit.M0A4
#define DMA1_C1M0ARL_M0A5        DMA1_C1M0ARL_bit.M0A5
#define DMA1_C1M0ARL_M0A6        DMA1_C1M0ARL_bit.M0A6
#define DMA1_C1M0ARL_M0A7        DMA1_C1M0ARL_bit.M0A7

#define DMA1_C2CR_EN             DMA1_C2CR_bit.EN
#define DMA1_C2CR_TCIE           DMA1_C2CR_bit.TCIE
#define DMA1_C2CR_HTIE           DMA1_C2CR_bit.HTIE
#define DMA1_C2CR_DIR            DMA1_C2CR_bit.DIR
#define DMA1_C2CR_CIRC           DMA1_C2CR_bit.CIRC
#define DMA1_C2CR_MINCDEC        DMA1_C2CR_bit.MINCDEC

#define DMA1_C2SPR_TCIF          DMA1_C2SPR_bit.TCIF
#define DMA1_C2SPR_HTIF          DMA1_C2SPR_bit.HTIF
#define DMA1_C2SPR_TSIZE         DMA1_C2SPR_bit.TSIZE
#define DMA1_C2SPR_PL0           DMA1_C2SPR_bit.PL0
#define DMA1_C2SPR_PL1           DMA1_C2SPR_bit.PL1
#define DMA1_C2SPR_PEND          DMA1_C2SPR_bit.PEND
#define DMA1_C2SPR_BUSY          DMA1_C2SPR_bit.BUSY

#define DMA1_C2NDTR_NDT0         DMA1_C2NDTR_bit.NDT0
#define DMA1_C2NDTR_NDT1         DMA1_C2NDTR_bit.NDT1
#define DMA1_C2NDTR_NDT2         DMA1_C2NDTR_bit.NDT2
#define DMA1_C2NDTR_NDT3         DMA1_C2NDTR_bit.NDT3
#define DMA1_C2NDTR_NDT4         DMA1_C2NDTR_bit.NDT4
#define DMA1_C2NDTR_NDT5         DMA1_C2NDTR_bit.NDT5
#define DMA1_C2NDTR_NDT6         DMA1_C2NDTR_bit.NDT6
#define DMA1_C2NDTR_NDT7         DMA1_C2NDTR_bit.NDT7

#define DMA1_C2PARH_PA8          DMA1_C2PARH_bit.PA8
#define DMA1_C2PARH_PA9          DMA1_C2PARH_bit.PA9
#define DMA1_C2PARH_PA10         DMA1_C2PARH_bit.PA10
#define DMA1_C2PARH_PA11         DMA1_C2PARH_bit.PA11
#define DMA1_C2PARH_PA12         DMA1_C2PARH_bit.PA12
#define DMA1_C2PARH_PA13         DMA1_C2PARH_bit.PA13
#define DMA1_C2PARH_PA14         DMA1_C2PARH_bit.PA14
#define DMA1_C2PARH_PA15         DMA1_C2PARH_bit.PA15

