yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l051f3.h
#define TIM2_EGR_UG              TIM2_EGR_bit.UG
#define TIM2_EGR_CC1G            TIM2_EGR_bit.CC1G
#define TIM2_EGR_CC2G            TIM2_EGR_bit.CC2G
#define TIM2_EGR_TG              TIM2_EGR_bit.TG
#define TIM2_EGR_BG              TIM2_EGR_bit.BG

#define TIM2_CCMR1_CC1S          TIM2_CCMR1_bit.CC1S
#define TIM2_CCMR1_OC1FE         TIM2_CCMR1_bit.OC1FE
#define TIM2_CCMR1_OC1PE         TIM2_CCMR1_bit.OC1PE
#define TIM2_CCMR1_OC1M          TIM2_CCMR1_bit.OC1M

#define TIM2_CCMR2_CC2S          TIM2_CCMR2_bit.CC2S
#define TIM2_CCMR2_OC2FE         TIM2_CCMR2_bit.OC2FE
#define TIM2_CCMR2_OC2PE         TIM2_CCMR2_bit.OC2PE
#define TIM2_CCMR2_OC2M          TIM2_CCMR2_bit.OC2M

#define TIM2_CCER1_CC1E          TIM2_CCER1_bit.CC1E
#define TIM2_CCER1_CC1P          TIM2_CCER1_bit.CC1P
#define TIM2_CCER1_CC2E          TIM2_CCER1_bit.CC2E
#define TIM2_CCER1_CC2P          TIM2_CCER1_bit.CC2P

#define TIM2_CNTRH_CNT8          TIM2_CNTRH_bit.CNT8
#define TIM2_CNTRH_CNT9          TIM2_CNTRH_bit.CNT9
#define TIM2_CNTRH_CNT10         TIM2_CNTRH_bit.CNT10
#define TIM2_CNTRH_CNT11         TIM2_CNTRH_bit.CNT11
#define TIM2_CNTRH_CNT12         TIM2_CNTRH_bit.CNT12
#define TIM2_CNTRH_CNT13         TIM2_CNTRH_bit.CNT13
#define TIM2_CNTRH_CNT14         TIM2_CNTRH_bit.CNT14
#define TIM2_CNTRH_CNT15         TIM2_CNTRH_bit.CNT15

#define TIM2_CNTRL_CNT0          TIM2_CNTRL_bit.CNT0
#define TIM2_CNTRL_CNT1          TIM2_CNTRL_bit.CNT1
#define TIM2_CNTRL_CNT2          TIM2_CNTRL_bit.CNT2
#define TIM2_CNTRL_CNT3          TIM2_CNTRL_bit.CNT3
#define TIM2_CNTRL_CNT4          TIM2_CNTRL_bit.CNT4
#define TIM2_CNTRL_CNT5          TIM2_CNTRL_bit.CNT5
#define TIM2_CNTRL_CNT6          TIM2_CNTRL_bit.CNT6
#define TIM2_CNTRL_CNT7          TIM2_CNTRL_bit.CNT7

#define TIM2_PSCR_PSC            TIM2_PSCR_bit.PSC

#define TIM2_ARRH_ARR8           TIM2_ARRH_bit.ARR8
#define TIM2_ARRH_ARR9           TIM2_ARRH_bit.ARR9
#define TIM2_ARRH_ARR10          TIM2_ARRH_bit.ARR10
#define TIM2_ARRH_ARR11          TIM2_ARRH_bit.ARR11
#define TIM2_ARRH_ARR12          TIM2_ARRH_bit.ARR12
#define TIM2_ARRH_ARR13          TIM2_ARRH_bit.ARR13
#define TIM2_ARRH_ARR14          TIM2_ARRH_bit.ARR14
#define TIM2_ARRH_ARR15          TIM2_ARRH_bit.ARR15

#define TIM2_ARRL_ARR0           TIM2_ARRL_bit.ARR0
#define TIM2_ARRL_ARR1           TIM2_ARRL_bit.ARR1
#define TIM2_ARRL_ARR2           TIM2_ARRL_bit.ARR2
#define TIM2_ARRL_ARR3           TIM2_ARRL_bit.ARR3
#define TIM2_ARRL_ARR4           TIM2_ARRL_bit.ARR4
#define TIM2_ARRL_ARR5           TIM2_ARRL_bit.ARR5
#define TIM2_ARRL_ARR6           TIM2_ARRL_bit.ARR6
#define TIM2_ARRL_ARR7           TIM2_ARRL_bit.ARR7

#define TIM2_CCR1H_CCR18         TIM2_CCR1H_bit.CCR18
#define TIM2_CCR1H_CCR19         TIM2_CCR1H_bit.CCR19
#define TIM2_CCR1H_CCR110        TIM2_CCR1H_bit.CCR110
#define TIM2_CCR1H_CCR111        TIM2_CCR1H_bit.CCR111
#define TIM2_CCR1H_CCR112        TIM2_CCR1H_bit.CCR112
#define TIM2_CCR1H_CCR113        TIM2_CCR1H_bit.CCR113
#define TIM2_CCR1H_CCR114        TIM2_CCR1H_bit.CCR114
#define TIM2_CCR1H_CCR115        TIM2_CCR1H_bit.CCR115

#define TIM2_CCR1L_CCR10         TIM2_CCR1L_bit.CCR10
#define TIM2_CCR1L_CCR11         TIM2_CCR1L_bit.CCR11
#define TIM2_CCR1L_CCR12         TIM2_CCR1L_bit.CCR12
#define TIM2_CCR1L_CCR13         TIM2_CCR1L_bit.CCR13
#define TIM2_CCR1L_CCR14         TIM2_CCR1L_bit.CCR14
#define TIM2_CCR1L_CCR15         TIM2_CCR1L_bit.CCR15
#define TIM2_CCR1L_CCR16         TIM2_CCR1L_bit.CCR16
#define TIM2_CCR1L_CCR17         TIM2_CCR1L_bit.CCR17

#define TIM2_CCR2H_CCR28         TIM2_CCR2H_bit.CCR28
#define TIM2_CCR2H_CCR29         TIM2_CCR2H_bit.CCR29
#define TIM2_CCR2H_CCR210        TIM2_CCR2H_bit.CCR210
#define TIM2_CCR2H_CCR211        TIM2_CCR2H_bit.CCR211
#define TIM2_CCR2H_CCR212        TIM2_CCR2H_bit.CCR212
#define TIM2_CCR2H_CCR213        TIM2_CCR2H_bit.CCR213
#define TIM2_CCR2H_CCR214        TIM2_CCR2H_bit.CCR214
#define TIM2_CCR2H_CCR215        TIM2_CCR2H_bit.CCR215

#define TIM2_CCR2L_CCR10         TIM2_CCR2L_bit.CCR10
#define TIM2_CCR2L_CCR11         TIM2_CCR2L_bit.CCR11
#define TIM2_CCR2L_CCR12         TIM2_CCR2L_bit.CCR12
#define TIM2_CCR2L_CCR13         TIM2_CCR2L_bit.CCR13
#define TIM2_CCR2L_CCR14         TIM2_CCR2L_bit.CCR14
#define TIM2_CCR2L_CCR15         TIM2_CCR2L_bit.CCR15
#define TIM2_CCR2L_CCR16         TIM2_CCR2L_bit.CCR16
#define TIM2_CCR2L_CCR17         TIM2_CCR2L_bit.CCR17

#define TIM2_BKR_LOCK            TIM2_BKR_bit.LOCK
#define TIM2_BKR_OSSI            TIM2_BKR_bit.OSSI
#define TIM2_BKR_BKE             TIM2_BKR_bit.BKE
#define TIM2_BKR_BKP             TIM2_BKR_bit.BKP
#define TIM2_BKR_AOE             TIM2_BKR_bit.AOE
#define TIM2_BKR_MOE             TIM2_BKR_bit.MOE

#define TIM2_OISR_OIS1           TIM2_OISR_bit.OIS1
#define TIM2_OISR_OIS2           TIM2_OISR_bit.OIS2

#endif

/*-------------------------------------------------------------------------
 *      TIM2 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM2_CR1_CEN        0x01
#define MASK_TIM2_CR1_UDIS       0x02
#define MASK_TIM2_CR1_URS        0x04
#define MASK_TIM2_CR1_OPM        0x08
#define MASK_TIM2_CR1_DIR        0x10
#define MASK_TIM2_CR1_CMS        0x60
#define MASK_TIM2_CR1_ARPE       0x80

#define MASK_TIM2_CR2_CCDS       0x08
#define MASK_TIM2_CR2_MMS        0x70
#define MASK_TIM2_CR2_TI1S       0x80

#define MASK_TIM2_SMCR_SMS       0x07
#define MASK_TIM2_SMCR_TS        0x70
#define MASK_TIM2_SMCR_MSM       0x80

#define MASK_TIM2_ETR_ETF        0x0F
#define MASK_TIM2_ETR_ETPS       0x30
#define MASK_TIM2_ETR_ECE        0x40
#define MASK_TIM2_ETR_ETP        0x80

#define MASK_TIM2_DER_UDE        0x01
#define MASK_TIM2_DER_CC1DE      0x02
#define MASK_TIM2_DER_CC2DE      0x04

#define MASK_TIM2_IER_UIE        0x01
#define MASK_TIM2_IER_CC1IE      0x02
#define MASK_TIM2_IER_CC2IE      0x04
#define MASK_TIM2_IER_TIE        0x40
#define MASK_TIM2_IER_BIE        0x80

#define MASK_TIM2_SR1_UIF        0x01
#define MASK_TIM2_SR1_CC1IF      0x02
#define MASK_TIM2_SR1_CC2IF      0x04
#define MASK_TIM2_SR1_TIF        0x40
#define MASK_TIM2_SR1_BIF        0x80

#define MASK_TIM2_SR2_CC1OF      0x02
#define MASK_TIM2_SR2_CC2OF      0x04

